config.org
:DOC-CONFIG:
#+property: header-args :emacs-lisp :tangle config.el :eval never
#+property: header-args :mkdirp yes :comments no :results output silent :noweb yes
#+startup: fold
:END:
#+HTML_HEAD: <link rel="stylesheet" href="https://latex.now.sh/style.css">

This file gets tangled into [[file:config.el]], [[file:init.el]], and
[[file:packages.el]].

* References
This is not a complete list. I have read though many people's configs
and sometimes I forget to remember where I got a snippet or some
inspiration from.

- [[https:https://github.com/zzamboni/dot-doom][zzamboni's doom emacs config]]
- [[https://tecosaur.github.io/emacs-config/config.html][tecosaur's doom emacs config]]
- [[https://gitlab.com/dwt1/dotfiles/-/blob/master/.config/doom/config.org][dt's doom emacs config]]

* Config file headers
We start by simply defining the standard headers used by the three
files. These headers come from the initial files generated by
=doom install=, and contain either some Emacs-LISP relevant indicators
like =lexical-binding=, or instructions about the contents of the file.

#+begin_src emacs-lisp :tangle init.el
;;; init.el -*- lexical-binding: t; -*-

;; DO NOT EDIT THIS FILE DIRECTLY
;; This is a file generated from a literate programing source file
;; You should make any changes there and regenerate it from Emacs org-mode
;; using org-babel-tangle (C-c C-v t)

;; This file controls what Doom modules are enabled and what order they load
;; in. Remember to run 'doom sync' after modifying it!

;; NOTE Press 'SPC h d h' (or 'C-h d h' for non-vim users) to access Doom's
;;      documentation. There you'll find a "Module Index" link where you'll find
;;      a comprehensive list of Doom's modules and what flags they support.

;; NOTE Move your cursor over a module's name (or its flags) and press 'K' (or
;;      'C-c c k' for non-vim users) to view its documentation. This works on
;;      flags as well (those symbols that start with a plus).
;;
;;      Alternatively, press 'gd' (or 'C-c c d') on a module to browse its
;;      directory (for easy access to its source code).
#+end_src

#+begin_src emacs-lisp :tangle packages.el
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; DO NOT EDIT THIS FILE DIRECTLY
;; This is a file generated from a literate programing source file
;; You should make any changes there and regenerate it from Emacs org-mode
;; using org-babel-tangle (C-c C-v t)

;; To install a package with Doom you must declare them here and run 'doom sync'
;; on the command line, then restart Emacs for the changes to take effect -- or
;; use 'M-x doom/reload'.

;; To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:
;;(package! some-package)

;; To install a package directly from a remote git repo, you must specify a
;; `:recipe'. You'll find documentation on what `:recipe' accepts here:
;; https://github.com/raxod502/straight.el#the-recipe-format
;;(package! another-package
;;  :recipe (:host github :repo "username/repo"))

;; If the package you are trying to install does not contain a PACKAGENAME.el
;; file, or is located in a subdirectory of the repo, you'll need to specify
;; `:files' in the `:recipe':
;;(package! this-package
;;  :recipe (:host github :repo "username/repo"
;;           :files ("some-file.el" "src/lisp/*.el")))

;; If you'd like to disable a package included with Doom, you can do so here
;; with the `:disable' property:
;;(package! builtin-package :disable t)

;; You can override the recipe of a built in package without having to specify
;; all the properties for `:recipe'. These will inherit the rest of its recipe
;; from Doom or MELPA/ELPA/Emacsmirror:
;;(package! builtin-package :recipe (:nonrecursive t))
;;(package! builtin-package-2 :recipe (:repo "myfork/package"))

;; Specify a `:branch' to install a package from a particular branch or tag.
;; This is required for some packages whose default branch isn't 'master' (which
;; our package manager can't deal with; see raxod502/straight.el#279)
;;(package! builtin-package :recipe (:branch "develop"))

;; Use `:pin' to specify a particular commit to install.
;;(package! builtin-package :pin "1a2b3c4d5e")

;; Doom's packages are pinned to a specific commit and updated from release to
;; release. The `unpin!' macro allows you to unpin single packages...
;;(unpin! pinned-package)
;; ...or multiple packages
;;(unpin! pinned-package another-pinned-package)
;; ...Or *all* packages (NOT RECOMMENDED; will likely break things)
;;(unpin! t)
#+end_src

#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; DO NOT EDIT THIS FILE DIRECTLY
;; This is a file generated from a literate programing source file
;; You should make any changes there and regenerate it from Emacs org-mode
;; using org-babel-tangle (C-c C-v t)

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!

;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
;; (setq user-full-name "John Doe"
;;      user-mail-address "john@doe.com")

;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
;; (setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
;;       doom-variable-pitch-font (font-spec :family "sans" :size 13))

;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
;; (setq doom-theme 'doom-one)

;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
;; (setq org-directory "~/org/")

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
;; (setq display-line-numbers-type t)

;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.
#+end_src

* Doom modules config
This is the entirety of my =init.el= file. This configures all of the
doom modules

#+begin_src emacs-lisp :tangle init.el
(doom!
#+end_src

** Input

I don't need any of these, and so I have these disabled.

#+begin_src emacs-lisp :tangle init.el
:input
;;chinese
;;japanese
;;layout
#+end_src

** Completion
#+begin_src emacs-lisp :tangle init.el
:completion
(company
 +childframe)
;;helm
;;ido
;; (ivy
;;  +icons
;;  +prescient)
(vertico
 +icons)
#+end_src

** UI

#+begin_src emacs-lisp :tangle init.el
:ui
#+end_src

I like the default emacs look a lot, so I pretty much just like to keep
it the same here.

#+begin_src emacs-lisp :tangle init.el
doom
doom-dashboard
(emoji
 +unicode
 +github)
#+end_src

These all in some way or another make code easier for me to read or make
the UI of emacs display some information that I like.

#+begin_src emacs-lisp :tangle init.el
hl-todo             ; highlight TODO/FIXME/NOTE, etc.
(ligatures
 +extra)
(modeline
 +light)
nav-flash           ; blink cursor line after big motions
(popup
 +all
 +defaults)
(vc-gutter
 +diff-hl)
workspaces
zen
#+end_src

I love how quick and easy =deft= makes it to take down a quick note that
may or may not relate to the current file This makes it much easier to
live in /emacs/ and not have to leave to another app.

#+begin_src emacs-lisp :tangle init.el
deft
#+end_src

For some reason or another I don't have each of these enabled.

#+begin_src emacs-lisp :tangle init.el
;;doom-quit
;;hydra
;;indent-guides     ; highlights indent columns
;;minimap           ; show a map of the code on the side
;;neotree           ; a project drawer, like NERDTree for vim
;;ophints
;;tabs
;;treemacs
;;unicode
;;vi-tilde-fringe
;;window-select     ; visually switch windows
#+end_src

** Editor

There isn't really much to say here, most of these are self explanatory.

#+begin_src emacs-lisp :tangle init.el
:editor
(evil +everywhere)  ; come to the dark side, we have cookies
file-templates      ; auto-snippets for empty files
fold                ; (nigh) universal code folding
(format +onsave)    ; automated prettiness
;;god               ; run Emacs commands without modifier keys
;;lispy             ; vim for emacs-lisp, for people who don't like vim
multiple-cursors    ; editing in many places at once
;;objed             ; text object editing for the innocent
;;parinfer          ; turn emacs-lisp into python, sort of
rotate-text         ; cycle region at point between text candidates
snippets            ; my elves. They type so I don't have to
word-wrap           ; soft wrapping with language-aware indent
#+end_src

** Emacs

Not much to say here other than that I use these and put them here.

#+begin_src emacs-lisp :tangle init.el
:emacs
(dired      ; making dired pretty [functional]
 +ranger
 +icons)
electric    ; smarter, keyword-based electric-indent
(ibuffer    ; interactive buffer management
 +icons)
(undo       ; persistent, smarter undo for your inevitable mistakes
 +tree)
vc          ; version-control and Emacs, sitting in a tree
#+end_src

** Term

I think vterm is the best terminal for /emacs/ and is the only one I've
liked so far.

#+begin_src emacs-lisp :tangle init.el
:term
eshell
;;shell
;;term
vterm
#+end_src

** Checkers

I tend to make a lot of silly mistakes. I couldn't imagine trying to
write anything without error checking

#+begin_src emacs-lisp :tangle init.el
:checkers
syntax
(spell
 +aspell
 +everywhere)
grammar
#+end_src

