init.el
;;; init.el -*- lexical-binding: t; -*-

;; DO NOT EDIT THIS FILE DIRECTLY
;; This is a file generated from a literate programing source file
;; You should make any changes there and regenerate it from Emacs org-mode
;; using org-babel-tangle (C-c C-v t)

;; This file controls what Doom modules are enabled and what order they load
;; in. Remember to run 'doom sync' after modifying it!

;; NOTE Press 'SPC h d h' (or 'C-h d h' for non-vim users) to access Doom's
;;      documentation. There you'll find a "Module Index" link where you'll find
;;      a comprehensive list of Doom's modules and what flags they support.

;; NOTE Move your cursor over a module's name (or its flags) and press 'K' (or
;;      'C-c c k' for non-vim users) to view its documentation. This works on
;;      flags as well (those symbols that start with a plus).
;;
;;      Alternatively, press 'gd' (or 'C-c c d') on a module to browse its
;;      directory (for easy access to its source code).

(doom!

:input
;;chinese
;;japanese
;;layout

:completion
(company
 +childframe)
;;helm
;;ido
;; (ivy
;;  +icons
;;  +prescient)
(vertico
 +icons)

:ui

doom
doom-dashboard
(emoji
 +unicode
 +github)

hl-todo             ; highlight TODO/FIXME/NOTE, etc.
(ligatures
 +extra)
(modeline
 +light)
nav-flash           ; blink cursor line after big motions
(popup
 +all
 +defaults)
(vc-gutter
 +diff-hl)
workspaces
zen

deft

;;doom-quit
;;hydra
;;indent-guides     ; highlights indent columns
;;minimap           ; show a map of the code on the side
;;neotree           ; a project drawer, like NERDTree for vim
;;ophints
;;tabs
;;treemacs
;;unicode
;;vi-tilde-fringe
;;window-select     ; visually switch windows

:editor
(evil +everywhere)  ; come to the dark side, we have cookies
file-templates      ; auto-snippets for empty files
fold                ; (nigh) universal code folding
(format +onsave)    ; automated prettiness
;;god               ; run Emacs commands without modifier keys
;;lispy             ; vim for emacs-lisp, for people who don't like vim
multiple-cursors    ; editing in many places at once
;;objed             ; text object editing for the innocent
;;parinfer          ; turn emacs-lisp into python, sort of
rotate-text         ; cycle region at point between text candidates
snippets            ; my elves. They type so I don't have to
word-wrap           ; soft wrapping with language-aware indent

:emacs
(dired      ; making dired pretty [functional]
 +ranger
 +icons)
electric    ; smarter, keyword-based electric-indent
(ibuffer    ; interactive buffer management
 +icons)
(undo       ; persistent, smarter undo for your inevitable mistakes
 +tree)
vc          ; version-control and Emacs, sitting in a tree

:term
eshell
;;shell
;;term
vterm

:checkers
syntax
(spell
 +aspell
 +everywhere)
grammar

:tools
(debugger
 +lsp)
biblio
direnv
(eval
 +overlay)
gist
(lookup
 +dictionary
 +offline)
lsp
magit
make
(pass
 +auth)
pdf
taskrunner
tree-sitter

;;ansible
;;docker
;;ein
