config.org
** Tools

These tools are so basic to my workflow that they can never be disabled.
These are part of the reason I use /emacs/.

#+begin_src emacs-lisp :tangle init.el
:tools
(debugger
 +lsp)
biblio
direnv
(eval
 +overlay)
gist
(lookup
 +dictionary
 +offline)
(lsp
 +peek)
magit
make
(pass
 +auth)
pdf
taskrunner
tree-sitter
#+end_src

These are just other tools that I have disabled.

#+begin_src emacs-lisp :tangle init.el
;;ansible
;;docker
;;ein
;;editorconfig      ; let someone else argue about tabs vs spaces
;;prodigy           ; FIXME managing external services & code builders
;;rgb               ; creating color strings
;;terraform         ; infrastructure as code
;;tmux              ; an API for interacting with tmux
;;upload            ; map local to remote projects via ssh/ftp
#+end_src

** OS

Exactly the same as the default emacs config.

#+begin_src emacs-lisp :tangle init.el
:os
(:if IS-MAC macos)  ; improve compatibility with macOS
;;tty               ; improve the terminal Emacs experience
#+end_src

** Lang

I write code in many different languages, both because of school and
because I like to. When I code, I usually prefer to have a language
server, and so this section ends up making my config pretty heavy
overall. I very often come here and enable or disable a language.

#+begin_src emacs-lisp :tangle init.el
:lang
;;agda              ; types of types of types of types...
;;beancount         ; mind the GAAP
(cc
 +lsp
 +tree-sitter)      ; C > C++ == 1 might add +lsp
;;clojure           ; java with a  emacs-lisp
;;common-lisp       ; if you've seen one emacs-lisp, you've seen them all
;;coq               ; proofs-as-programs
;;crystal           ; ruby at the speed of c
;;csharp            ; unity, .NET, and mono shenanigans
data              ; config/data formats
;; (dart
;;  +flutter
;;  +lsp)           ; paint ui and not much else
;;elixir            ; erlang done right
;;elm               ; care for a cup of TEA?
emacs-lisp          ; drown in parentheses
;;erlang            ; an elegant language for a more civilized age
;;ess               ; emacs speaks statistics
;;factor
;;faust             ; dsp, but you get to keep your soul
;;fsharp            ; ML stands for Microsoft's Language
;;fstar             ; (dependent) types and (monadic) effects and Z3
;;gdscript          ; the language you waited for
;;(go +lsp)         ; the hipster dialect
(haskell
 +lsp)              ; a language that's lazier than I am
;;hy                ; readability of scheme w/ speed of python
;;idris             ; a language you can depend on
json                ; At least it ain't XML
;;(java +meghanada) ; the poster child for carpal tunnel syndrome
;;javascript        ; all(hope(abandon(ye(who(enter(here))))))
;;julia             ; a better, faster MATLAB
;;kotlin            ; a better, slicker Java(Script)
(latex
 +cdlatex)          ; writing papers in Emacs has never been so fun
;;lean              ; for folks with too much to prove
;;ledger            ; be audit you can be
lua                 ; one-based indices? one-based indices
markdown            ; writing docs for people to ignore
;;nim               ; python + emacs-lisp at the speed of c
(nix
 +tree-sitter)      ; I hereby declare "nix geht mehr!"
;;ocaml             ; an objective camel
(org
 +crypt
 +dragndrop
 +gnuplot
 +hugo
 +journal
 +noter
 +pandoc
 +passwords
 +present
 +pretty
 +roam2)            ; organize your plain life in plain text
;;php               ; perl's insecure younger brother
;;plantuml          ; diagrams for confusing people more
;;purescript        ; javascript, but functional
(python             ; beautiful is better than ugly
 +lsp
 +poetry
 +pyright
 +tree-sitter)
;; qt                  ; the 'cutest' gui framework ever
;;racket            ; a DSL for DSLs
;;raku              ; the artist formerly known as perl6
;;rest              ; Emacs as a REST client
;;rst               ; ReST in peace
;;(ruby +rails)     ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
(rust
 +lsp
 +tree-sitter)      ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
;;scala             ; java, but good
;;(scheme +guile)   ; a fully conniving family of emacs-lisps
(sh                 ; she sells {ba,z,fi}sh shells on the C xor
 +fish
 +tree-sitter)
;;sml
;;solidity          ; do you need a blockchain? No.
;;swift             ; who asked for emoji variables?
;;terra             ; Earth and Moon in alignment for performance.
;;web               ; the tubes
yaml                ; JSON, but readable
;;zig               ; C, but simpler
#+end_src

** Email
#+begin_src emacs-lisp :tangle init.el
:email
(mu4e
 +gmail
 +org)
;;notmuch
;;(wanderlust +gmail)
#+end_src
** App
#+begin_src emacs-lisp :tangle init.el
:app
;;calendar
;;emms
;;everywhere        ; *leave* Emacs!? You must be joking
;;irc               ; how neckbeards socialize
;;(rss +org)        ; emacs as an RSS reader
;;twitter           ; twitter client https://twitter.com/vnought
#+end_src
** Config

#+begin_src emacs-lisp :tangle init.el
:config
literate
(default
  +bindings
  +smartparens)
#+end_src

** Closing

#+begin_src emacs-lisp :tangle init.el
)
#+end_src

* General config
** ~append!~ macro
#+begin_src emacs-lisp
(cl-defmacro append! (var &rest values)
  "Append VALUES to the end of VAR, if they don't already exist in VAR."
  (declare (indent defun))
  `(dolist (value (list ,@values))
     (unless (member value ,var)
       (setf ,var (append ,var (list value))))))
#+end_src
** Temporary Fixes
*** vterm
#+begin_src emacs-lisp :tangle init.el
(after! comp
  ;; HACK Disable native-compilation for some troublesome packages
  (mapc (doom-partial #'add-to-list 'native-comp-deferred-compilation-deny-list)
        (list "/emacs-jupyter.*\\.el\\'"
              "/evil-collection-vterm\\.el\\'"
              "/vterm\\.el\\'"
              "/with-editor\\.el\\'")))
#+end_src
*** Native-comp
#+begin_src emacs-lisp :tangle init.el
(setq native-comp-deferred-compilation nil)
(after! (doom-packages straight)
  (setq straight--native-comp-available t))
#+end_src
*** =transient= and =with-editor=
#+begin_src emacs-lisp :tangle packages.el
(package! transient :pin "c2bdf7e12c530eb85476d3aef317eb2941ab9440")
(package! with-editor :pin "391e76a256aeec6b9e4cbd733088f30c677d965b")
#+end_src
** NixOS and nix-darwin setup
- Load NixOS site-lisp.
- Have =pdf-tools= use =nix-shell= to build its server.

#+begin_src emacs-lisp
(when-let ((site-start (locate-library "site-start.el")))
  (load site-start)
  (message "Loaded %s" site-start)
  (when (modulep! :tools pdf)
      (setq pdf-tools-installer-os "nixos")))
#+end_src
** My personal info
#+begin_src emacs-lisp
(setq user-full-name "Kirols Bakheat"
      user-mail-address "kbakheat@gmail.com")
#+end_src

** Undo
#+begin_src emacs-lisp
(after! undo-tree
  (map! :leader
        "o U" nil
        :desc "Undo tree" "o u" #'undo-tree-visualize)
  (setq undo-tree-auto-save-history t
        undo-tree-visualizer-diff t
        undo-tree-visualizer-timestamps t))
#+end_src
** Add my snippets
This loads up my personal yasnipptes and adds them to the ones provided by doom.
#+begin_src emacs-lisp
(defvar my/snippets-dir (expand-file-name "snippets/" doom-user-dir))
(after! yasnippet
  (add-to-list 'yas-snippet-dirs 'my/snippets-dir)
    (yas-load-directory my/snippets-dir t))
#+end_src
** Keybindings
*** Clipboard
Same as vim, unnamed register applies only to this application (Emacs). "+" register applies to the system clipboard.
#+begin_src emacs-lisp
(after! evil-collection
  (setq select-enable-clipboard nil))
#+end_src
*** Keybindings for my mac.
#+begin_src emacs-lisp
(cond (IS-MAC
       (setq mac-command-modifier       'meta
             mac-option-modifier        'meta
             mac-right-option-modifier  'alt)))
#+end_src

*** Remap eval
As much as I like /"M-x"/ to type commands, I think /"SPC ;"/ is sometimes easier to hit. Unfortunately, it uses =pp-eval-expression= instead of =execute-extended-command=. This is here to remedy that and switch the two.
#+begin_src emacs-lisp
(map! :leader
      (:desc "M-x" ";" #'execute-extended-command)
      (:desc "eval-expression" ":" #'pp-eval-expression))
#+end_src
*** Swap compile and recompile
It makes more sense to me to have =c c= for recompile and =c C= for compile since I recompile more often than I compile.
#+begin_src emacs-lisp
(map! :leader
      (:desc "Reompile" "c c" #'recompile)
      (:desc "Compile" "c C" #'compile))
#+end_src
*** =toggle-debug-on-error=
#+begin_src emacs-lisp
(defvar my/debug-on-error nil)
(defun my/toggle-debug-on-error ()
  "Toggle debug-on-error."
  (interactive)
  (setq my/debug-on-error (not my/debug-on-error))
  (setq debug-on-error my/debug-on-error)
  (setq async-debug my/debug-on-error)
  (setq org-export-async-debug my/debug-on-error)
  (message "debug-on-error is %s" my/debug-on-error))


(map! :leader
      (:desc "Debug on error" "t d" #'my/toggle-debug-on-error))
#+end_src
*** Pass
#+begin_src emacs-lisp
(map! :leader
      (:desc "Pass" "o p" #'pass))
#+end_src
*** (Un)comment lines
#+begin_src emacs-lisp
(map! :leader
       (:desc "Comment/uncomment lines" "t /" #'comment-line))
#+end_src
** Evil Bookmarks
*** Fringes
#+begin_src emacs-lisp :tangle packages.el
(package! evil-fringe-mark)
#+end_src
#+begin_src emacs-lisp
(when (modulep! :editor evil)
  (use-package! evil-fringe-mark
    :unless noninteractive
    :after evil
    :hook (after-init . global-evil-fringe-mark-mode)
    :commands (evil-fringe-mark-mode)
    :config (setq evil-fringe-mark-show-special t)
    :init
    (map!
     :leader
     :desc "Toggle fringe marks" "t`" #'evil-fringe-mark-mode
     :desc "Show marks" "o`" #'evil-show-marks)))
#+end_src
*** Persist marks
#+begin_src emacs-lisp
(when (modulep! :editor evil)
  (after! savehist
    (add-to-list 'savehist-additional-variables 'evil-markers-alist)
    (add-hook 'savehist-save-hook (lambda ()
                                    (kill-local-variable 'evil-markers-alist)
                                    (dolist (entry evil-markers-alist)
                                      (when (markerp (cdr entry))
                                        (setcdr entry (cons (file-truename (buffer-file-name (marker-buffer (cdr entry))))
                                                            (marker-position (cdr entry))))))))
    (add-hook 'savehist-mode-hook (lambda ()
                                    (setq-default evil-markers-alist evil-markers-alist)
                                    (kill-local-variable 'evil-markers-alist)
                                    (make-local-variable 'evil-markers-alist))))
  ;; Persist local marks
  (append! desktop-locals-to-save evil-markers-alist))
#+end_src

** Shell
#+begin_src emacs-lisp
(after! vterm
  (setq vterm-shell "fish"))
#+end_src
** Browser changes
