config.org
**** Secondary gmail
#+begin_src emacs-lisp
(set-email-account! "secondary"
  '((mu4e-sent-folder       . "/kirolsb5-gmail/Sent Mail")
    (mu4e-drafts-folder     . "/kirolsb5-gmail/Drafts")
    (mu4e-trash-folder      . "/kirolsb5-gmail/Trash")
    (mu4e-refile-folder     . "/kirolsb5-gmail/All Mail")
    (smtpmail-smtp-user     . "kbakheat@gmail.com")
    (mu4e-compose-signature . "---\nKirols Bakheat"))
  t)
#+end_src
**** Detroit Mercy email
#+begin_src emacs-lisp
(set-email-account! "udmercy"
  '((mu4e-sent-folder       . "/bakheakm-udmercy/Sent Items")
    (mu4e-drafts-folder     . "/bakheakm-udmercy/Drafts")
    (mu4e-trash-folder      . "/bakheakm-udmercy.edu/Trash")
    (mu4e-refile-folder     . "/bakheakm-udmercy/Archive")
    (smtpmail-smtp-user     . "bakheakm@udmercy.edu")
    (mu4e-compose-signature . "---\nKirols Bakheat"))
  t)
#+end_src

** =man= and =tldr=
#+begin_src emacs-lisp :tangle packages.el
(package! tldr)
#+end_src

#+begin_src emacs-lisp
(use-package! tldr
  :commands tldr
  :config (setq tldr-directory-path (expand-file-name "tldr/" doom-data-dir)))
(map!
 :leader :prefix ("h h" . "command line help")
 :desc "man" "m" #'man
 :desc "tldr" "t" #'tldr)
#+end_src
** =biblio=
#+begin_src emacs-lisp
(defvar my/citations-dir
  (concat doom-user-dir "citations/"))

(after! org-cite
  (setq org-cite-csl-styles-dir (concat my/citations-dir "styles/")))
(after! bibtex-completion
  (setq!
   bibtex-completion-bibliography  (concat my/citations-dir "ref.bib")
   ;bibtex-completion-library-path '("/path/to/library/path/")
   ;bibtex-completion-notes-path "/path/to/your/notes/"
   ))
#+end_src
** Licenses
#+begin_src emacs-lisp :tangle packages.el
(package! lice)
#+end_src

#+begin_src emacs-lisp
(use-package! lice
  :commands lice)
(map!
 :leader
 :desc "Insert license" "i l" #'lice)
#+end_src
** =string-inflection=
I don't use this that often but it is convenient when I occasionally need it.

#+begin_src emacs-lisp :tangle packages.el
(package! string-inflection)
#+end_src
#+begin_src emacs-lisp
(use-package! string-inflection
  :commands (string-inflection-all-cycle
             string-inflection-toggle
             string-inflection-camelcase
             string-inflection-lower-camelcase
             string-inflection-kebab-case
             string-inflection-underscore
             string-inflection-capital-underscore
             string-inflection-upcase)
  :init
  (map! :leader :prefix ("c~" . "naming convention")
        :desc "cycle" "~" #'string-inflection-all-cycle
        :desc "toggle" "t" #'string-inflection-toggle
        :desc "CamelCase" "c" #'string-inflection-camelcase
        :desc "downCase" "d" #'string-inflection-lower-camelcase
        :desc "kebab-case" "k" #'string-inflection-kebab-case
        :desc "under_score" "_" #'string-inflection-underscore
        :desc "Upper_Score" "u" #'string-inflection-capital-underscore
        :desc "UP_CASE" "U" #'string-inflection-upcase)
  (after! evil
    (evil-define-operator evil-operator-string-inflection (beg end _type)
      "Define a new evil operator that cycles symbol casing."
      :move-point nil
      (interactive "<R>")
      (string-inflection-all-cycle)
      (setq evil-repeat-info '([?g ?~])))
    (define-key evil-normal-state-map (kbd "g~") 'evil-operator-string-inflection)))
    #+end_src
** Github Copilot
#+begin_src emacs-lisp :tangle packages.el
(package! copilot
  :recipe (:host github :repo "zerolfx/copilot.el" :files ("*.el" "dist")))
#+end_src

#+begin_src emacs-lisp
(use-package! copilot
  :unless noninteractive
  :hook (prog-mode . copilot-mode)
  :hook (text-mode . copilot-mode)
  :config
  (map! :map copilot-completion-map
    "C-s"       #'copilot-accept-completion
    "M-<right>" #'copilot-accept-completion-by-word
    "C-f"       #'copilot-accept-completion-by-line
    "M-n"       #'copilot-next-completion
    "M-p"       #'copilot-previous-completion
    "C-b"       #'copilot-complete))
#+end_src
** =envrc=
#+begin_src emacs-lisp :tangle packages.el
(unpin! envrc)
#+end_src
** Org mode
*** General config
#+begin_src emacs-lisp
(defun my/relative-org (dir)
  "Makes a sting representing a directory relative to my org base directory"
  (setq my-org-base-dir "~/org")
  (concat (file-name-as-directory my-org-base-dir) dir))
(setq
 org-directory (my/relative-org "general")
 deft-directory (my/relative-org "deft"))

(after! org
  (add-to-list 'org-latex-packages-alist '("" "fancyhdr"))
  (add-to-list 'org-latex-packages-alist '("" "siunitx"))
  (plist-put org-format-latex-options :scale 1)
  (setq
   org-hide-leading-stars nil
   org-insert-heading-respect-content nil
   org-export-in-background t
   org-export-with-sub-superscripts '{}
   org-list-allow-alphabetical t)
  (map! :map org-mode-map
        :localleader
        (:prefix ("SPC" . "Personal org map")))

  (setq org-clock-persist t)
  (org-clock-persistence-insinuate)

  (defun locally-defer-font-lock ()
    "Set jit-lock defer and stealth, when buffer is over a certain size."
    (when (> (buffer-size) 50000)
      (setq-local jit-lock-defer-time 0.05
                  jit-lock-stealth-time 1)))
  (add-hook 'org-mode-hook #'locally-defer-font-lock))
#+end_src
*** =org-babel= default /header-args/
#+begin_src emacs-lisp
(after! org
  (setq
   org-babel-default-header-args
   '((:results . "replace")
     (:exports . "both")
     (:cache . "yes")
     (:noweb . "yes")
     (:hlines . "no")
     (:mkdirp . "yes")
     (:tangle . "no"))))
#+end_src
*** Beautification of org-mode
**** =org= specific config
#+begin_src emacs-lisp
(after! org
  (setq
   org-auto-align-tags t
   org-tags-column 0
   org-catch-invisible-edits 'smart
   org-special-ctrl-a/e t
   org-insert-heading-respect-content t

   org-fontify-quote-and-verse-blocks t
   org-fontify-whole-heading-line t
   org-fontify-done-headline t
   org-src-fontify-natively t

   org-ellipsis " ↷"
   org-hide-emphasis-markers t
   org-pretty-entities t))
#+end_src
**** =org-agenda=
#+begin_src emacs-lisp
(after! org-agenda
  (setq
   org-agenda-tags-column 0
   org-agenda-block-separator ?─
   org-agenda-time-grid
   '((daily today require-timed)
     (800 1000 1200 1400 1600 1800 2000)
     " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
   org-agenda-current-time-string
   "⭠ now ─────────────────────────────────────────────────"))
#+end_src
*** Roam
#+begin_src emacs-lisp
(setq org-roam-v2-ack t)
(after! org-roam
  (setq
   org-roam-directory (my/relative-org "roam")
   org-roam-completion-everywhere t))
#+end_src
**** Templates
#+begin_src emacs-lisp
(after! org-roam
  (add-to-list 'org-roam-capture-templates
               '("r" "Templates for religious meditations"))

  (add-to-list 'org-roam-capture-templates
               '("rl" "Lesson" plain "#+filetags: lesson \"Topic: ${topic}\"\n* %?"
                 :if-new (file+head "religious/lessons/%<%Y%m%d%H%M%S>-${slug}.org"
                                    "#+title: ${title}\n\n")
                 :unnarrowed t))

  (add-to-list
   'org-roam-capture-templates
   '("rs" "Saint" plain "#+filetags: saint \"Saint Type: ${saint type}\" \"Years: ${birth year}-${death year}\" \"Country: ${country}\" \"City: ${city}\"\n\n* Birth\n%?\n\n* Life\n\n\n* Death\n\n\n* Related saints\n\n"
     :if-new (file+head "religious/saints/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
     :unnarrowed t))
  (add-to-list
   'org-roam-capture-templates
   '("rb" "Bible Study" plain "#+filetags: \"bible study\" \"Book: ${book}\" \"Topic: ${topic}\"\n\n* Topic\n\n* Related\n** Passages\n\n** Meditations\n\n* Personal Meditation\n\n"
     :if-new (file+head "religious/bible-study/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
     :unnarrowed t)))
#+end_src
*** Xenops
Originally had =fragtog= here but switched to =xenops= because it
doesn't interrupt my typing as bad. I don't like that this messes with other /doom/ keybindings though.

#+begin_src emacs-lisp :tangle packages.el
(package! xenops)
#+end_src

#+begin_src emacs-lisp
(use-package! xenops
  :commands (xenops-mode)
  :init (map! :map org-mode-map
              :localleader
              :desc "enable xenops" "SPC x" #'xenops-mode)
  :config (setq xenops-math-image-current-scale-factor 2.0))
#+end_src
*** Org-auto-tangle
#+begin_src emacs-lisp :tangle packages.el
(package! org-auto-tangle)
#+end_src

#+begin_src emacs-lisp
(use-package! org-auto-tangle
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))
#+end_src
*** Lilypond
#+begin_src emacs-lisp
(use-package! lilypond-mode
  :commands LilyPond-mode
  :init (defalias 'lilypond-mode 'LilyPond-mode)
  :config
  (if IS-MAC
      (setq org-babel-lilypond-commands '("lilypond" "open" "open"))))
#+end_src
*** =ox-latex=
#+begin_src emacs-lisp
(after! ox-latex
  (add-to-list 'org-latex-logfiles-extensions "tex"))
#+end_src
**** Syntax highlighting
#+begin_src emacs-lisp :tangle packages.el
(package! engrave-faces
  :recipe (:host github :repo "tecosaur/engrave-faces"))
#+end_src

#+name: engrave-faces-init
#+begin_src emacs-lisp
(defvar-local org-export-has-code-p nil)

(defadvice! org-export-expect-no-code (&rest _)
  :before #'org-export-as
  (setq org-export-has-code-p nil))

(defadvice! org-export-register-code (&rest _)
  :after #'org-latex-src-block
  :after #'org-latex-inline-src-block-engraved
  (setq org-export-has-code-p t))

(defadvice! org-latex-example-block-engraved (orig-fn example-block contents info)
  "Like `org-latex-example-block', but supporting an engraved backend"
  :around #'org-latex-example-block
  (let ((output-block (funcall orig-fn example-block contents info)))
    (if (eq 'engraved (plist-get info :latex-listings))
        (format "\\begin{Code}[alt]\n%s\n\\end{Code}" output-block)
      output-block)))
#+end_src

#+begin_src emacs-lisp
(use-package! engrave-faces-latex
  :after ox-latex
  :init
  <<engrave-faces-init>>
  :config
  (setq org-latex-listings 'engraved))
(use-package! engrave-faces-html
  :after ox-html
  :init
  <<engrave-faces-init>>
  :config
  (setq org-latex-listings 'engraved))
#+end_src
**** =ox-chameleon=
Occasionally I want to export a file that looks like emacs. This is mostly done for presentation's sake.
#+begin_src emacs-lisp :tangle packages.el
(package! ox-chameleon
  :recipe (:host github :repo "tecosaur/ox-chameleon"))
#+end_src
#+begin_src emacs-lisp
(use-package! ox-chameleon
  :after ox
  :config
  (add-to-list 'org-latex-packages-alist '("" "scrextend" nil))
  (add-to-list 'org-latex-packages-alist '("" "xcolor" nil)))
#+end_src
**** Classes
#+begin_src emacs-lisp
(after! ox-latex
  (add-to-list 'org-latex-packages-alist '("" "siunitx"))
  (add-to-list 'org-latex-packages-alist '("" "amsmath"))
  (add-to-list 'org-latex-packages-alist '("" "fancyhdr"))
  (add-to-list 'org-latex-classes
               '("IEEEtran" "\\documentclass[11pt]{IEEEtran}"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" .    "\\subparagraph*{%s}")))
  (add-to-list 'org-latex-classes
               '("exam"
                 "\\documentclass{exam}"
                 ("\\begin{questions} %% %s"
                  "\\end{questions}"
                  "\\begin{questions} %% %s"
                  "\\end{questions}")
                 ("\\question %s " . "\\question* %s")
                 ("\\begin{parts} %s"
                  "\\end{parts}"
                  "\\begin{parts} %s"
                  "\\end{parts}"))))
#+end_src
*** =literate-calc-mode=
#+begin_src emacs-lisp :tangle packages.el
(package! literate-calc-mode)
#+end_src

#+begin_src emacs-lisp
(use-package! literate-calc-mode
  :commands (literate-calc-minor-mode
             literate-calc-eval-line
             literate-calc-insert-results)
  :init (map! :map org-mode-map
              :localleader
              (:prefix ("SPC c" . "literate calc")
               (:desc "Enable" "e" #'literate-calc-minor-mode)
               (:desc "Evaluate line" "c" #'literate-calc-eval-line)
               (:desc "Insert results" "i" #'literate-calc-insert-results))))
#+end_src
*** =org-tree-slide-mode=
#+begin_src emacs-lisp
(use-package! org-tree-slide
  :config
  (map! :map org-tree-slide-mode-map
        :n "M-<left>"  #'org-tree-slide-move-previous-tree
        :n "M-<right>" #'org-tree-slide-move-next-tree))
#+end_src
* Footers

#+begin_src emacs-lisp
(provide 'config)
;;; config.el ends here
#+end_src

#+begin_src emacs-lisp :tangle init.el
(provide 'init)
;;; init.el ends here
#+end_src

#+begin_src emacs-lisp :tangle packages.el
(provide 'packages)
;;; packages.el ends here
#+end_src
