packages.el

(package! string-inflection)

(package! copilot
  :recipe (:host github :repo "zerolfx/copilot.el" :files ("*.el" "dist")))

(unpin! envrc)

(package! org-modern)

(package! xenops)

(package! org-auto-tangle)

(package! engrave-faces
  :recipe (:host github :repo "tecosaur/engrave-faces"))

(package! ox-chameleon
  :recipe (:host github :repo "tecosaur/ox-chameleon"))

(package! literate-calc-mode)

(provide 'packages)
;;; packages.el ends here
